codeboxqc/Tezos-hub75-esp32/esp32/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <WiFiUdp.h>
#include <ArduinoJson.h>
#include <ESPAsyncWebServer.h>
#include <ElegantOTA.h>
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>
#include <JPEGDecoder.h>
#include "web.h"


// Enable watchdog monitoring
#include "esp_system.h"
#include "esp_task_wdt.h"



// ===== USER SETTINGS =====
char ssid[32] = "user";
char password[64] = "pass";
char playlistUrl[128] = "https://paradox.ovh/led-art/nfts.json";
char updateUrl[128]   = "https://paradox.ovh/led-art/update.php";

#define PANEL_RES_X 64
#define PANEL_RES_Y 64
#define PANEL_CHAIN 1
#define LDR_PIN 34


// Custom HUB75 pins
#define R1_PIN 17
#define G1_PIN 18
#define B1_PIN 8
#define R2_PIN 3
#define G2_PIN 2
#define B2_PIN 10
#define A_PIN  15
#define B_PIN  11
#define C_PIN  7
#define D_PIN  4
#define E_PIN  13
#define LAT_PIN 6
#define OE_PIN  12
#define CLK_PIN 5

MatrixPanel_I2S_DMA *display = nullptr;
AsyncWebServer server(80);
WiFiUDP udp;


 

#define MAX_COLLECTION 10 
Art collection[MAX_COLLECTION+1];
int artCount = 0;
int currentIndex = 0;

uint32_t rotateTimer = 40000  ;
uint32_t sec15 = 12000;

unsigned long lastSwitch = 0;

int textX;
char scrollText[256] = "\0";

// Image download buffer
uint8_t *imageBuffer = nullptr;
size_t imageSize = 0;

unsigned long imageShownTime = 0;
bool textActive = false; 

extern void logo();

// Function prototypes
void triggerServerUpdate();
void fetchPlaylist();
void displayNext();
void showStatus(const char* msg, uint16_t color = 0xFFFF);
bool downloadImage(const char* url);
 
uint16_t applyGammaRGB565(uint16_t color, int x, int y);
void cleanText(const char* input, char* output, size_t maxLen);

#define BUTTON_SAVE_PIN 0 
bool savePressed = false;

 extern void SetConfig();



/////////////////////////////////////////////////
//avoid mem defragmentation

 class ImageDownloader {
private:
    uint8_t* _buffer = nullptr;
    size_t _maxSize = 0;
    size_t _lastImageSize = 0;
    bool _isPSRAM = false;

public:
    // Initialize once in setup()
    bool begin(size_t maxExpectedSize) {
        _maxSize = maxExpectedSize;
        
        // AUTO-DETECT: Try PSRAM first, then Internal RAM
        if (psramFound()) {
            _buffer = (uint8_t*)ps_malloc(_maxSize);
            if (_buffer) {
                _isPSRAM = true;
                Serial.printf("Image Buffer: %d KB allocated in PSRAM\n", _maxSize/1024);
            }
        }

        if (!_buffer) {
            _buffer = (uint8_t*)malloc(_maxSize);
            _isPSRAM = false;
            if (_buffer) {
                Serial.printf("Image Buffer: %d KB allocated in INTERNAL RAM\n", _maxSize/1024);
            }
        }

        if (!_buffer) {
            Serial.println("CRITICAL ERROR: Could not allocate image buffer!");
            return false;
        }
        return true;
    }

    // Robust download logic
    bool download(const char* url) {
        if (WiFi.status() != WL_CONNECTED || !_buffer) return false;

        HTTPClient http;
        http.begin(url);
        http.setTimeout(10000); // 10 second connection timeout
        
        // Add headers to prevent caching issues
        http.addHeader("User-Agent", "ESP32-Art-Wall");
        
        int httpCode = http.GET();
        if (httpCode == 200) {
            size_t contentLength = http.getSize();
            
            if (contentLength > _maxSize) {
                Serial.printf("Download error: Image size (%d) > Buffer (%d)\n", contentLength, _maxSize);
                http.end();
                return false;
            }

            WiFiClient* stream = http.getStreamPtr();
            _lastImageSize = 0;
            
            unsigned long startMillis = millis();
            while (http.connected() && (_lastImageSize < contentLength || contentLength == -1)) {
                size_t avail = stream->available();
                if (avail) {
                    // Read data directly into our persistent buffer
                    size_t read = stream->readBytes(_buffer + _lastImageSize, 
                                                   min(avail, (size_t)(_maxSize - _lastImageSize)));
                    _lastImageSize += read;
                    startMillis = millis(); // Reset timeout as long as we get data
                } else {
                    if (millis() - startMillis > 5000) { // 5s timeout during data transfer
                        Serial.println("Download timeout during stream!");
                        break;
                    }
                    delay(1);
                }
                yield(); // Keep WiFi and Watchdog happy
            }
            http.end();
            return (_lastImageSize > 0);
        }
        
        Serial.printf("HTTP GET Failed, error: %s\n", http.errorToString(httpCode).c_str());
        http.end();
        return false;
    }

    // Getters
    uint8_t* getBuffer() { return _buffer; }
    size_t getSize() { return _lastImageSize; }
};

// Create the global instance
 
 
// ===== GLOBAL   (Allocated once, prevents fragmentation) =====
ImageDownloader defrag;

DynamicJsonDocument jsonDoc(10240); 

////////////////////////////////////////////






 
// ==========

// Enable watchdog monitoring
#include "esp_system.h"
#include "esp_task_wdt.h"

// Track reboot reason
void printRebootReason() {
    esp_reset_reason_t reason = esp_reset_reason();
    Serial.print("Last reboot reason: ");
    switch (reason) {
        case ESP_RST_POWERON:   Serial.println("Power-on"); break;
        case ESP_RST_SW:        Serial.println("Software reset"); break;
        case ESP_RST_PANIC:     Serial.println("Exception/panic"); break;
        case ESP_RST_INT_WDT:   Serial.println("Interrupt watchdog"); break;
        case ESP_RST_TASK_WDT:  Serial.println("Task watchdog"); break;
        case ESP_RST_WDT:       Serial.println("Other watchdog"); break;
        case ESP_RST_DEEPSLEEP: Serial.println("Deep sleep"); break;
        case ESP_RST_BROWNOUT:  Serial.println("Brownout (low voltage!)"); break;
        case ESP_RST_SDIO:      Serial.println("SDIO reset"); break;
        default:                Serial.println("Unknown"); break;
    }
}
 

void cleanText(const char* input, char* output, size_t maxLen) {
    size_t out_idx = 0;
    size_t in_len = strlen(input);

    for (size_t i = 0; i < in_len && out_idx < maxLen - 1; ) {
        uint8_t c = (uint8_t)input[i];

        if (c <= 0x7F) { // ASCII
            output[out_idx++] = (c >= 32) ? (char)c : ' ';
            i++;
        } else { // Multi-byte UTF8 sequences
            output[out_idx++] = ' ';
            if ((c & 0xE0) == 0xC0) i += 2;
            else if ((c & 0xF0) == 0xE0) i += 3;
            else if ((c & 0xF8) == 0xF0) i += 4;
            else i++;
        }
    }
    output[out_idx] = '\0';
}



