codeboxqc/Tezos-hub75-esp32/esp32/src/main.cpp
void urlEncode(const char* input, char* output, size_t maxLen) {
    const char* hex = "0123456789ABCDEF";
    size_t outIdx = 0;
    
    for (size_t i = 0; input[i] && outIdx < maxLen - 4; i++) {
        unsigned char c = input[i];
        
        if ((c >= 'A' && c <= 'Z') || 
            (c >= 'a' && c <= 'z') || 
            (c >= '0' && c <= '9') ||
            c == '-' || c == '_' || c == '.' || c == '~' ||
            c == '/' || c == ':') {
            output[outIdx++] = c;
        } else {
            output[outIdx++] = '%';
            output[outIdx++] = hex[c >> 4];
            output[outIdx++] = hex[c & 0x0F];
        }
    }
    output[outIdx] = '\0';
}


void showStatus(const char* msg, uint16_t color) {
    // Clear ONLY the bottom 8 pixels (y = 56 to 63)
    display->fillRect(0, 56, 64, 8, 0); 
    display->setTextSize(1);
    display->setCursor(2, 56); // Move cursor to the bottom row
    display->setTextColor(color);
    display->print(msg);
    
    Serial.print("STATUS: "); Serial.println(msg);
}



 
 
 
void drawJPEG() {
    uint8_t* buf = defrag.getBuffer();
    size_t sz = defrag.getSize();

    if (!buf || sz == 0) {
        Serial.println("Draw Error: No image in buffer");
        return;
    }

    if (!JpegDec.decodeArray(buf, sz)) {
        Serial.println("JPEG Decode failed (Corrupt image?)");
        return;
    }
    
    int blockCount = 0;
    while (JpegDec.read()) {
        uint16_t* pixels = JpegDec.pImage;
        int baseX = JpegDec.MCUx * JpegDec.MCUWidth;
        int baseY = JpegDec.MCUy * JpegDec.MCUHeight;
        
        display->drawRGBBitmap(baseX, baseY, pixels, JpegDec.MCUWidth, JpegDec.MCUHeight);
        
        // Feed watchdog every 8 blocks to prevent timeout
        if (++blockCount % 8 == 0) {
            esp_task_wdt_reset();
        }
        
        yield();
    }
    JpegDec.abort();
}


void drawJPEG16color() {
    uint8_t* buf = defrag.getBuffer();
    size_t sz = defrag.getSize();

    if (!buf || sz == 0) {
        Serial.println("Draw Error: No image in buffer");
        return;
    }

    if (!JpegDec.decodeArray(buf, sz)) {
        Serial.println("JPEG Decode failed");
        return;
    }

    const int maxW = display->width();   // 64
    const int maxH = display->height();  // 64

    // IMPORTANT: use swapped bytes for HUB75
    while (JpegDec.readSwappedBytes()) {

        int x = JpegDec.MCUx * JpegDec.MCUWidth;
        int y = JpegDec.MCUy * JpegDec.MCUHeight;

        if (x >= maxW || y >= maxH) continue;

        int w = JpegDec.MCUWidth;
        int h = JpegDec.MCUHeight;

        if (x + w > maxW) w = maxW - x;
        if (y + h > maxH) h = maxH - y;

        display->drawRGBBitmap(
            x,
            y,
            JpegDec.pImage,
            w,
            h
        );

        static uint8_t yd = 0;
        if ((yd++ & 3) == 0) yield();
    }

    JpegDec.abort();
}




bool downloadImage(const char* url) {
    if (WiFi.status() != WL_CONNECTED) return false;
    if (!url || strlen(url) < 10) {
        Serial.println("Download aborted: Invalid URL");
        return false;
    }

    if (defrag.download(url)) {
        // Double check we actually got data
        if (defrag.getSize() > 100) { 
            return true;
        }
    }
    return false;
}


 


 void triggerServerUpdate() {
    Serial.println(">>> Starting Server Update...");
    showStatus("Updating", 0xFFE0); // Yellow "Updating" at bottom

    if (WiFi.status() != WL_CONNECTED) {
        showStatus("NO WIFI", 0xF800);
        return;
    }
    
    char ncUrl[256];
    snprintf(ncUrl, sizeof(ncUrl), "%s?nc=%lu", updateUrl, millis());
    
    HTTPClient http;
    http.begin(ncUrl);
    http.setTimeout(20000); 
    
    int httpCode = http.GET();
    
    if (httpCode == 200) { 
        showStatus("Done!", 0x07E0); // Green "Done!" at bottom
        Serial.println("Update.php finished successfully");
        delay(1000); 
    } else {
        char errMsg[32];
        snprintf(errMsg, sizeof(errMsg), "ERR %d", httpCode);
        showStatus(errMsg, 0xF800);
        delay(3000);
    }
    http.end();
}




void fetchPlaylist() {
    showStatus("GET JSON...");
    if (WiFi.status() != WL_CONNECTED) return;
    
    HTTPClient http;
    http.begin(playlistUrl);
    http.setTimeout(15000);
    Serial.println("Fetching playlist...");
    esp_task_wdt_reset(); 

    int httpCode = http.GET();

    
    
    if (httpCode == 200) {
        jsonDoc.clear();
        esp_task_wdt_reset();
        DeserializationError error = deserializeJson(jsonDoc, http.getStream());

        
        if (!error) {
            // Reset count and clear old data
            int found = jsonDoc.size();
            artCount = 0; 
            
            for (int i = 0; i < found && i < MAX_COLLECTION; i++) {
                const char* url = jsonDoc[i]["url"];
                // Only add to collection if URL is not empty
                if (url && strlen(url) > 10) {
                    strlcpy(collection[artCount].url, url, 250);
                    strlcpy(collection[artCount].artist, jsonDoc[i]["artist"] | "Unknown", 60);
                    strlcpy(collection[artCount].title, jsonDoc[i]["title"] | "Untitled", 60);
                    strlcpy(collection[artCount].price, jsonDoc[i]["price"] | "", 30);
                    artCount++;
                    if(artCount>=10) { artCount=10; break; }
                }
            }
            Serial.printf("Playlist: Validated %d valid entries\n", artCount);
        }
        yield();
    }
    http.end();
    esp_task_wdt_reset();
}


 
void displayNext() {
    Serial.println("--- displayNext() called ---");
    esp_task_wdt_reset(); // Feed at start

    // If collection is empty, try to load it
    if (artCount == 0) {
        Serial.println("Collection empty, fetching fresh data...");
        esp_task_wdt_reset();
        
        triggerServerUpdate();
        esp_task_wdt_reset(); // Feed after server update
        
