codeboxqc/Tezos-hub75-esp32/esp32/src/main.cpp
        fetchPlaylist();
        esp_task_wdt_reset(); // Feed after playlist fetch
        
        // NOW check if we actually got art
        if (artCount == 0) {
            Serial.println("ERROR: Still no art after update!");
            showStatus("NO ART", 0xF800);
            delay(5);
            return;
        }
        
        Serial.printf("SUCCESS: Loaded %d artworks\n", artCount);
        currentIndex = -1; // Reset to -1 so first increment makes it 0
    }

    bool success = false;
    int attempts = 0;

    while (!success && attempts < artCount) {
        esp_task_wdt_reset(); // Feed each iteration
        
        currentIndex++;
        attempts++;

        if (currentIndex >= artCount) {
            Serial.println("End of playlist, refreshing...");
            esp_task_wdt_reset();
            
            triggerServerUpdate();
            esp_task_wdt_reset();
            
            fetchPlaylist();
            esp_task_wdt_reset();
            
            currentIndex = 0;
            if (artCount == 0) return;
        }

        // Prepare text
        char rawText[256];
        snprintf(rawText, sizeof(rawText), "%s by %s [%s]", 
                 collection[currentIndex].title, 
                 collection[currentIndex].artist, 
                 collection[currentIndex].price);
        cleanText(rawText, scrollText, sizeof(scrollText));

        // Show loading info at bottom bar only
        char loadMsg[16];
        snprintf(loadMsg, sizeof(loadMsg), "Load %d", currentIndex + 1);
        showStatus(loadMsg, 0x07E0);
        
        Serial.printf("Attempting to download: %s\n", collection[currentIndex].url);
        esp_task_wdt_reset();

        // Try to download and display the image
        if (downloadImage(collection[currentIndex].url)) {
            Serial.println("Download successful, rendering...");
            esp_task_wdt_reset(); // Feed before rendering
            
            display->fillScreen(0); // Clear screen for new image
            esp_task_wdt_reset();
            
            drawJPEG(); // or drawJPEG16color()
            esp_task_wdt_reset(); // Feed after rendering
            
            success = true;
            Serial.printf("Image %d displayed successfully\n", currentIndex);
        } else {
            Serial.printf("Failed to download image %d, trying next...\n", currentIndex);
            showStatus("Skip...", 0xF800);
            delay(5);
        }
        
        yield();
    }

    if (!success) {
        Serial.println("CRITICAL: Failed to load ANY images after trying all!");
        showStatus("ALL FAIL", 0xF800);
        delay(5);
        artCount = 0; // Force refresh on next call
    } else {
        // Image successfully displayed
        imageShownTime = millis();
        textActive = false;
        lastSwitch = millis();
        Serial.printf("Display complete. Free heap: %d bytes\n", ESP.getFreeHeap());
    }
    
    esp_task_wdt_reset(); // Feed at end
}


void updateBrightness() { 
    /*
    static uint8_t lastB = 0;
    uint8_t currentB = 254; 
    if (currentB != lastB) {
        display->setBrightness8(currentB);
        lastB = currentB;
    }
        */


        yield();
}

void saveCurrentOriginal() {
    if (artCount == 0 || currentIndex >= artCount || currentIndex < 0) {
        Serial.println("Cannot save: no valid artwork");
        return;
    }
    
    // Check if display is initialized
    if (!display) {
        Serial.println("Display not initialized");
        return;
    }
    
    // Clear bottom bar
    display->fillRect(0, 56, 64, 8, 0); 
    display->setCursor(1, 56);
    display->setTextColor(0xFFE0);
    display->print("Saving...");
    Serial.println("Saving...");

    if (WiFi.status() != WL_CONNECTED) {
        display->fillRect(0, 56, 64, 8, 0);
        display->setCursor(1, 56);
        display->setTextColor(0xF800);
        display->print("NO WIFI");
        delay(2000);
        return;
    }

    // URL encode
    char encodedUrl[512];
    urlEncode(collection[currentIndex].url, encodedUrl, sizeof(encodedUrl));
    
    char savePath[600];
    snprintf(savePath, sizeof(savePath), 
             "https://paradox.ovh/led-art/save.php?url=%s", encodedUrl);
    
    HTTPClient http;
    http.begin(savePath);
    http.setTimeout(10000);
    int httpCode = http.GET();
    http.end();

    display->fillRect(0, 56, 64, 8, 0);
    display->setCursor(1, 56);
    if (httpCode == 200) {
        display->setTextColor(0x07E0);
        display->print("Saved!");
        Serial.println("Saved!");
    } else {
        display->setTextColor(0xF800);
        display->printf("ERR %d", httpCode);
        Serial.printf("Error: %d\n", httpCode);
    }

    delay(2000);
    display->fillRect(0, 56, 64, 8, 0); 
}








///////////////////////////////////////////////////////////
bool Wi() {
    bool hasCredentials = (strlen(webConfig.ssid) > 0 && 
                          strcmp(webConfig.ssid, "") != 0);
    bool wifiConnected = false;
    int maxAttempts = 3;
    
    if (hasCredentials) {
        for (int attempt = 1; attempt <= maxAttempts && !wifiConnected; attempt++) {
            Serial.printf("\n[Attempt %d/%d] Connecting to: %s\n", 
                         attempt, maxAttempts, webConfig.ssid);
            
            char statusMsg[16];
            snprintf(statusMsg, sizeof(statusMsg), "WiFi %d/%d", attempt, maxAttempts);
            showStatus(statusMsg, 0xFFE0);
            
            WiFi.mode(WIFI_STA);
            WiFi.begin(webConfig.ssid, webConfig.password);  // Use webConfig, not ssid/password
            
            int retries = 0;
            while (WiFi.status() != WL_CONNECTED && retries < 20) {
                delay(500);
                Serial.print(".");
                retries++;
                esp_task_wdt_reset();
            }
            
            if (WiFi.status() == WL_CONNECTED) {
                wifiConnected = true;
                Serial.println("\n✓ Connected!");
            } else {
                Serial.println("\n✗ Failed");
                WiFi.disconnect(true);
                delay(1000);
            }
        }
    }
    
    if (!wifiConnected) {
        Serial.println("\n╔═════════════════════════════════════╗");
        Serial.println("║  WiFi Connection Failed!          ║");
        Serial.println("║  Starting Access Point Mode...    ║");
        Serial.println("╚═════════════════════════════════════╝");
        
