codeboxqc/Tezos-hub75-esp32/esp32/src/main.cpp
        resetWiFiConfig();
        showStatus("AP MODE", 0xF800);
        delay(1000);
        
        WiFi.mode(WIFI_AP);
        WiFi.softAP("TEZ", "");  // Open AP, no password
        
        IPAddress apIP = WiFi.softAPIP();
        
        Serial.printf("\nAP Started!\n");
        Serial.printf("SSID: TEZ (no password)\n");
        Serial.printf("IP: %s\n\n", apIP.toString().c_str());
        
        // Display AP info
        display->fillScreen(0);
        display->setTextSize(1);
        display->setTextColor(0xFFE0);
        display->setCursor(1, 2);
        display->print("WiFi:TEZ");
        display->setTextColor(0xFFFF);
        display->setCursor(1, 22);
        display->print(apIP.toString().c_str());
        
        // Blink to get attention
        for (int i = 0; i < 3; i++) {
            delay(300);
            display->setBrightness8(100);
            delay(300);
            display->setBrightness8(webConfig.brightness);
        }
        
    } else {
        Serial.printf("\n✓ Connected to WiFi: %s\n", webConfig.ssid);
        Serial.printf("   IP: %s\n", WiFi.localIP().toString().c_str());
        Serial.printf("   Signal: %d dBm\n\n", WiFi.RSSI());
        
        showStatus("WiFi OK!", 0x07E0);
        delay(1000);
        
        display->fillScreen(0);
        display->setTextSize(1);
        display->setTextColor(0x07E0);
        display->setCursor(8, 15);
        display->print("CONNECTED");
        display->setTextColor(0x07FF);
        display->setCursor(4, 30);
        display->print(webConfig.ssid);
        display->setTextColor(0xFFFF);
        display->setCursor(2, 45);
        display->print(WiFi.localIP().toString().c_str());
        delay(2000);
    }

    // Setup web server
    setupWebServer(&server);
    return wifiConnected;
}
 /////////////////////////////////////////////





void setup() {
    Serial.begin(115200);
    Serial.println("\n\n=== ESP32 Tezos Art Wall ===");


    //esp32 memory test allocation
//////////////////////////////////////////
    // Try allocating 250KB
    /*
    uint8_t* testBuf = (uint8_t*)malloc(250000);
    if (testBuf) {
        Serial.println("✅ 250KB malloc SUCCESS - could handle 128×128 hub75  4 hub");
        free(testBuf);
    } else {
        Serial.println("❌ 250KB malloc FAILED - cannot handle 128×128");
    }
    
    Serial.printf("Free heap: %d\n", ESP.getFreeHeap());
    */
////////////////////////////////////////////
    
Serial.println("Init defrag..."); 
Serial.flush();



/////////////////////////////////////////////////////
// resetWiFiConfig();  //password user




//////////////////////////////////////////////////////////





///////////////////////////////////////////////
   printRebootReason(); // See WHY it rebooted
    
    // Print memory info
    Serial.printf("Total heap: %d bytes\n", ESP.getHeapSize());
    Serial.printf("Free heap: %d bytes\n", ESP.getFreeHeap());
    Serial.printf("PSRAM: %s\n", psramFound() ? "YES" : "NO");
    
    // ===== WATCHDOG CONFIGURATION =====
    // Increase watchdog timeout to 30 seconds (default is 5s)
    esp_task_wdt_init(30, true);
    esp_task_wdt_add(NULL); // Add current task to watchdog
    Serial.println("Watchdog: 30s timeout enabled");
/////////////////////////////////////////////////////////////////

  // ===== LOAD WEB CONFIGURATION =====
     strlcpy(webConfig.ssid, "user", 32);
    strlcpy(webConfig.password, "pass", 64);
    strlcpy(webConfig.playlistUrl, "https://paradox.ovh/led-art/nfts.json", 128);
    strlcpy(webConfig.updateUrl, "https://paradox.ovh/led-art/update.php", 128);
    webConfig.rotateTimer = 40000;
    webConfig.textDelay = 12000;
    webConfig.brightness = 255;

    handleLoadConfig();
    // Use loaded config for WiFi
    if (strlen(webConfig.ssid) > 0) {
        strlcpy((char*)ssid, webConfig.ssid, 32);
        strlcpy((char*)password, webConfig.password, 64);
    }
    if (strlen(webConfig.playlistUrl) > 0) {
       // strlcpy(playlistUrl, webConfig.playlistUrl, 128);
    }
    if (strlen(webConfig.updateUrl) > 0) {
      //  strlcpy(updateUrl, webConfig.updateUrl, 128);
    }

 

    

  /////////////////////////////////////////////    
    // Initialize image buffer
    if (!defrag.begin(80000)) {
        Serial.println("FATAL: Memory Init Failed");
        while(1) { 
            delay(1000);
            esp_task_wdt_reset(); // Keep feeding watchdog even in error
        }
    }
    /////////////////////////////////////////////////////////

    HUB75_I2S_CFG::i2s_pins pins = {R1_PIN, G1_PIN, B1_PIN, R2_PIN, G2_PIN, B2_PIN, A_PIN, B_PIN, C_PIN, D_PIN, E_PIN, LAT_PIN, OE_PIN, CLK_PIN};
    HUB75_I2S_CFG mxconfig(PANEL_RES_X, PANEL_RES_Y, PANEL_CHAIN, pins);
    mxconfig.clkphase = 1;
    mxconfig.latch_blanking = 4;

    display = new MatrixPanel_I2S_DMA(mxconfig);
    display->begin();
    display->setBrightness8(100);
    display->fillScreen(0);

    pinMode(BUTTON_SAVE_PIN, INPUT_PULLUP);

     Wi();

      
  

    ElegantOTA.begin(&server);
    server.begin();
}




void loop() {
    static unsigned long lastWatchdogFeed = 0;
    static unsigned long lastHeapCheck = 0;
    static uint32_t minHeap = 0xFFFFFFFF;

    // ===== CRITICAL: Feed watchdog FIRST, every loop =====
    if (millis() - lastWatchdogFeed > 1000) { // Every 1 second (was 5s - too slow!)
        esp_task_wdt_reset();
        lastWatchdogFeed = millis();
    }

    // Monitor heap every 30 seconds
    if (millis() - lastHeapCheck > 30000) {
        uint32_t freeHeap = ESP.getFreeHeap();
        if (freeHeap < minHeap) {
            minHeap = freeHeap;
            Serial.printf("⚠️  New min heap: %d bytes\n", minHeap);
        }
        Serial.printf("Heap: %d bytes (min: %d)\n", freeHeap, minHeap);
        lastHeapCheck = millis();
    }

    // Main rotation timer
    if (millis() - lastSwitch > rotateTimer || lastSwitch == 0) {
        lastSwitch = millis();
        esp_task_wdt_reset(); // Feed before heavy operation
        displayNext();
        
