codeboxqc/Tezos-hub75-esp32/esp32/src/main.cpp
        // UDP broadcast (optional)
        if (udp.beginPacket("255.255.255.255", 4210)) {
            udp.write(currentIndex);
            udp.endPacket();
        }
        esp_task_wdt_reset(); // Feed after heavy operation
    }

    // Skip text animation if no images loaded
    if (artCount == 0) {
        delay(100);
        return;
    }

    // Wait before showing text
    if (millis() - imageShownTime < sec15) {
        yield();
        delay(10); // Reduced from 30ms - allows more responsive watchdog feeding
        return;
    }

    // Start text animation
    if (!textActive) {
        textActive = true;
        textX = PANEL_RES_X;
    }

    // ===== FIXED: Animate scrolling text WITHOUT blocking =====
    if (textActive) {
        static unsigned long lastMove = 0;
        
        // Only update display every 30ms (smooth scrolling speed)
        if (millis() - lastMove > 30) {
            lastMove = millis();
            
            // Clear only the text strip
            display->fillRect(0, 56, 64, 8, 0); 
            display->setTextColor(display->color565(0, 255, 0));
            display->setCursor(textX, 56);
            display->print(scrollText);
            
            textX -= 1;

            // Calculate exact width: approx 6 pixels per character
            int textWidth = strlen(scrollText) * 6;
            if (textX < -textWidth) {
                textX = PANEL_RES_X; // Reset to right side
            }
            
            // Feed watchdog during animation
            esp_task_wdt_reset();
        }
    }

    // Button handling with proper debouncing
    static unsigned long lastButtonPress = 0;
    if (digitalRead(BUTTON_SAVE_PIN) == LOW) {
        if (!savePressed && (millis() - lastButtonPress > 500)) {
            savePressed = true;
            lastButtonPress = millis();
            esp_task_wdt_reset(); // Feed before potentially slow operation
            saveCurrentOriginal();
            esp_task_wdt_reset(); // Feed after
        }
    } else {
        savePressed = false;
    }

    // CRITICAL: Always yield at end of loop to prevent blocking
    yield();
    
    // Small delay to prevent tight loop (reduces CPU usage)
    delay(5);
}

  